# Image Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RibbonButton..::..Image Property
RibbonButton Class See Also
---
The image of the button.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ImageSource Image { get; set; }
```

Visual Basic
---
```text
Public Property Image As ImageSource
	Get
	Set
```

Visual C++
---
```text
public:
property ImageSource^ Image {
	ImageSource^ get ();
	void set (ImageSource^ value);
}
```

# Remarks
The image will be shown on the button if it is a part of a stacked set or if it is promoted to the Quick Access Toolbar. The image should be 16 x 16 pixels. If the image is larger it will NOT be adjusted to fit the button.
# See Also
RibbonButton Class
Autodesk.Revit.UI Namespace